<details>
  <summary><strong>라이브러리와 프레임워크의 차이점은 무엇인가요?</strong></summary>

<br>

## 라이브러리(Library)
: 특정 기능을 구현한 코드 묶음으로, 개발자가 필요에 따라 호출해 사용하는 도구.

- 개발자가 주도적으로 라이브러리의 기능을 호출하여 사용.
- 특정 작업을 단순화하거나 반복적으로 사용되는 기능을 제공.
- 개발자는 코드 흐름을 스스로 제어하고 필요한 시점에 라이브러리를 사용.
  
Python: NumPy, Pandas
JavaScript: Axios

<br>

## 프레임워크(Framework)
: 애플리케이션 구조를 정의하며, 개발자가 그 위에 코드를 작성하도록 하는 틀.

- 프레임워크가 코드의 흐름을 주도하며, 개발자는 필요한 부분만 작성.
- 프레임워크는 실행 흐름과 생명 주기를 관리하고, 개발자는 규칙과 패턴에 따라 코드를 작성.
- 프레임워크의 규칙을 따르지 않으면 애플리케이션이 제대로 동작하지 않을 가능성이 큼.

Python: Django, Flask
JavaScript: React, Angular, Vue.js
Java: Spring

즉, 개발자가 코드 제어의 주도권을 쥐고 있냐, 아니냐에 따라 라이브러리와 프레임워크의 차이가 발생합니다.
React 같은 경우는 라이브러리로 출발했지만, 현재는 프레임워크처럼 사용되고 있습니다.

</details>
